In [14]:
import pandas as pd

In [15]:
data = pd.read_csv('Fire_Incident_Dispatch_Data.csv')

In [16]:
data.head()

,INCIDENT_DATETIME,ALARM_BOX_BOROUGH,ALARM_BOX_LOCATION,INCIDENT_BOROUGH,ZIPCODE
0,1/1/2005 0:00,RICHMOND / STATEN ISLAND,MERRYMOUNT ST & NOME AVE,RICHMOND / STATEN ISLAND,10314.0
1,1/1/2005 0:00,BRONX,ARTHUR AVE & 183 ST,BRONX,10458.0
2,1/1/2005 0:01,BROOKLYN,TOMPKINS & PARK AVES,BROOKLYN,11206.0
3,1/1/2005 0:01,QUEENS,ASTORIA BLVD AND 2ND ST,QUEENS,11102.0
4,1/1/2005 0:01,QUEENS,JACKSON & 42 RD,QUEENS,11101.0

In [17]:
data.info

<bound method DataFrame.info of         INCIDENT_DATETIME         ALARM_BOX_BOROUGH  \
0           1/1/2005 0:00  RICHMOND / STATEN ISLAND
1           1/1/2005 0:00                     BRONX
2           1/1/2005 0:01                  BROOKLYN
3           1/1/2005 0:01                    QUEENS
4           1/1/2005 0:01                    QUEENS
...                   ...                       ...
1048570   2/22/2007 18:33                 MANHATTAN
1048571   2/22/2007 18:34                  BROOKLYN
1048572   2/22/2007 18:35                  BROOKLYN
1048573   2/22/2007 18:35                     BRONX
1048574   2/22/2007 18:37                 MANHATTAN

                        ALARM_BOX_LOCATION          INCIDENT_BOROUGH  ZIPCODE
0                 MERRYMOUNT ST & NOME AVE  RICHMOND / STATEN ISLAND  10314.0
1                      ARTHUR AVE & 183 ST                     BRONX  10458.0
2                     TOMPKINS & PARK AVES                  BROOKLYN  11206.0
3                  ASTORIA BLVD AND 2ND ST                    QUEENS  11102.0
4                          JACKSON & 42 RD                    QUEENS  11101.0
...                                    ...                       ...      ...
1048570        PARK AVE 200' S OF E 135 ST                 MANHATTAN  10037.0
1048571                      5 AVE & 59 ST                  BROOKLYN  11220.0
1048572       AVE N & PERI LANE AT E 71 ST                  BROOKLYN  11234.0
1048573  FT OF ERDMAN PL S/SECT CO-OP CITY                     BRONX  10475.0
1048574            AVE OF AMERICAS & 44 ST                 MANHATTAN  10036.0

[1048575 rows x 5 columns]>

In [29]:
data =data.dropna()

In [30]:
data.isnull().sum()

INCIDENT_DATETIME     0
ALARM_BOX_BOROUGH     0
ALARM_BOX_LOCATION    0
INCIDENT_BOROUGH      0
ZIPCODE               0
dtype: int64

In [31]:
data.head()

,INCIDENT_DATETIME,ALARM_BOX_BOROUGH,ALARM_BOX_LOCATION,INCIDENT_BOROUGH,ZIPCODE
0,1/1/2005 0:00,RICHMOND / STATEN ISLAND,MERRYMOUNT ST & NOME AVE,RICHMOND / STATEN ISLAND,10314.0
1,1/1/2005 0:00,BRONX,ARTHUR AVE & 183 ST,BRONX,10458.0
2,1/1/2005 0:01,BROOKLYN,TOMPKINS & PARK AVES,BROOKLYN,11206.0
3,1/1/2005 0:01,QUEENS,ASTORIA BLVD AND 2ND ST,QUEENS,11102.0
4,1/1/2005 0:01,QUEENS,JACKSON & 42 RD,QUEENS,11101.0

In [32]:
data.count()

INCIDENT_DATETIME     979352
ALARM_BOX_BOROUGH     979352
ALARM_BOX_LOCATION    979352
INCIDENT_BOROUGH      979352
ZIPCODE               979352
dtype: int64

In [56]:
arr = data['INCIDENT_BOROUGH'].unique()

In [57]:
arr

array(['RICHMOND / STATEN ISLAND', 'BRONX', 'BROOKLYN', 'QUEENS',
       'MANHATTAN'], dtype=object)

In [53]:
len(arr)

231

In [59]:
#data.to_csv('Data.csv')

In [73]:
data = pd.read_csv('Data.csv')

In [74]:
data.head()

  INCIDENT_DATETIME          INCIDENT_BOROUGH  ZIPCODE
0     1/1/2005 0:00  RICHMOND / STATEN ISLAND    10314
1     1/1/2005 0:00                     BRONX    10458
2     1/1/2005 0:01                  BROOKLYN    11206
3     1/1/2005 0:01                    QUEENS    11102
4     1/1/2005 0:01                    QUEENS    11101

In [75]:
data['INCIDENT_BOROUGH'].unique()

array(['RICHMOND / STATEN ISLAND', 'BRONX', 'BROOKLYN', 'QUEENS',
       'MANHATTAN'], dtype=object)

In [76]:
data.nunique()

INCIDENT_DATETIME    628108
INCIDENT_BOROUGH          5
ZIPCODE                 231
dtype: int64

In [77]:
data

       INCIDENT_DATETIME          INCIDENT_BOROUGH  ZIPCODE
0          1/1/2005 0:00  RICHMOND / STATEN ISLAND    10314
1          1/1/2005 0:00                     BRONX    10458
2          1/1/2005 0:01                  BROOKLYN    11206
3          1/1/2005 0:01                    QUEENS    11102
4          1/1/2005 0:01                    QUEENS    11101
...                  ...                       ...      ...
979347   2/22/2007 18:33                 MANHATTAN    10037
979348   2/22/2007 18:34                  BROOKLYN    11220
979349   2/22/2007 18:35                  BROOKLYN    11234
979350   2/22/2007 18:35                     BRONX    10475
979351   2/22/2007 18:37                 MANHATTAN    10036

[979352 rows x 3 columns]